[
  {
    "title": "He is a human skeleton, Gaza hostage's brother tells BBC",
    "description": "Ilay David says the Hamas video showing his brother Evyatar emaciated and weak is a \"new form of cruelty\" that has left his parents shattered.",
    "pub_date": "Mon, 04 Aug 2025 17:05:21 GMT"
  },
  {
    "title": "UK-French small boats pilot plan comes into force",
    "description": "The 'one-in, one-out' deal will see some of those arriving in the UK returned to France.",
    "pub_date": "Mon, 04 Aug 2025 21:34:23 GMT"
  },
  {
    "title": "Obesity jab patients need a plan to stop weight coming back, health experts say",
    "description": "Patients coming off Wegovy or Mounjaro should have support and advice for at least a year afterwards, NHS told.",
    "pub_date": "Mon, 04 Aug 2025 23:00:10 GMT"
  },
  {
    "title": "Tommy Robinson arrested in connection with assault at St Pancras station",
    "description": "The far-right activist was arrested on suspicion of GBH at Luton Airport this evening.",
    "pub_date": "Mon, 04 Aug 2025 20:24:41 GMT"
  },
  {
    "title": "Disfigured, shamed and forgotten: The BBC visits the Korean survivors of the Hiroshima bomb",
    "description": "When the atom bomb was dropped, 140,000 Koreans were in Japan's Hiroshima city, many as forced labour.",
    "pub_date": "Mon, 04 Aug 2025 22:04:35 GMT"
  },
  {
    "title": "Four-year-old girl dies following incident at water park",
    "description": "The girl was treated at the scene before being taken to hospital, say police who are investigating.",
    "pub_date": "Mon, 04 Aug 2025 20:45:39 GMT"
  },
  {
    "title": "Trump threatens India with 'substantial' tariff hike for buying Russian oil",
    "description": "The US president says India doesn't care \"how many people in Ukraine are being killed\" - but India calls the tariff threat \"unjustified\".",
    "pub_date": "Mon, 04 Aug 2025 21:28:49 GMT"
  },
  {
    "title": "Storm Floris batters UK with winds over 80mph",
    "description": "An amber warning covers most of Scotland and there is a yellow warning in parts of England, Wales and Northern Ireland.",
    "pub_date": "Mon, 04 Aug 2025 22:49:37 GMT"
  },
  {
    "title": "Love Island 2025 winners revealed after drama-filled series",
    "description": "The winners of the ITV2 series are announced during Monday's live final in Mallorca.",
    "pub_date": "Mon, 04 Aug 2025 22:39:18 GMT"
  },
  {
    "title": "Danish zoo asks for unwanted pets to feed its predators",
    "description": "Aalborg Zoo says the unique scheme is aimed at mimicking what its predators would eat in the wild.",
    "pub_date": "Mon, 04 Aug 2025 19:45:12 GMT"
  }
]